In [11]:
import pandas as pd
df=pd.read_csv('datos_con_faltantes.csv',encoding='latin-1')
df.head()
print("valores faltantes por columna")
print(df)
print(df.isnull().sum())

df['Edad']=df['Edad'].fillna(df['Edad'].mean())
df['Nombre']=df['Nombre'].fillna('Desconocido')
df['Ciudad']=df['Ciudad'].fillna('Desconocido')
print(df)
print("valores faltantes por fila")
print(df.isnull().sum(axis=1))

print("Datos duplicados en el dataset")
print(df.duplicated())
print(df.drop_duplicates())

valores faltantes por columna
  Nombre  Edad     Ciudad
0    Ana  23.0     Madrid
1   Juan  29.0        NaN
2  Pedro   NaN  Barcelona
3    NaN  40.0    Sevilla
4  Maria  35.0        NaN
Nombre    1
Edad      1
Ciudad    2
dtype: int64
        Nombre   Edad       Ciudad
0          Ana  23.00       Madrid
1         Juan  29.00  Desconocido
2        Pedro  31.75    Barcelona
3  Desconocido  40.00      Sevilla
4        Maria  35.00  Desconocido
valores faltantes por fila
0    0
1    0
2    0
3    0
4    0
dtype: int64
Datos duplicados en el dataset
0    False
1    False
2    False
3    False
4    False
dtype: bool
        Nombre   Edad       Ciudad
0          Ana  23.00       Madrid
1         Juan  29.00  Desconocido
2        Pedro  31.75    Barcelona
3  Desconocido  40.00      Sevilla
4        Maria  35.00  Desconocido

In [12]:
Q1=df['Edad'].quantile(0.25)
Q3=df['Edad'].quantile(0.75)
IQR=Q3-Q1
lower_bound=Q1-1.5*IQR
upper_bound=Q3+1.5*IQR
outliers=df[(df['Edad']<lower_bound)|(df['Edad']>upper_bound)]
print("Outliers identificados")
print(outliers)

df_sin_outliers=df[~((df['Edad']<lower_bound)|(df['Edad']>upper_bound))]
print(df_sin_outliers)
print("Analisis descriptivo de los datos")
print(df_sin_outliers.describe())

Outliers identificados
Empty DataFrame
Columns: [Nombre, Edad, Ciudad]
Index: []
        Nombre   Edad       Ciudad
0          Ana  23.00       Madrid
1         Juan  29.00  Desconocido
2        Pedro  31.75    Barcelona
3  Desconocido  40.00      Sevilla
4        Maria  35.00  Desconocido
Analisis descriptivo de los datos
            Edad
count   5.000000
mean   31.750000
std     6.378675
min    23.000000
25%    29.000000
50%    31.750000
75%    35.000000
max    40.000000

In [14]:
import pandas as pd

df=pd.read_csv("datos_con_faltantes.csv")

print("Datos originales")
print(df)

print("Valores faltantes por columna")
print(df.isnull().sum())
# Vamos a sacar el promedio de todas las edades y se le va asignar la registor 2 en la columna edad
df['Edad']=df['Edad'].fillna(df['Edad'].mean())
print(df)
print('')

Datos originales
  Nombre  Edad     Ciudad
0    Ana  23.0     Madrid
1   Juan  29.0        NaN
2  Pedro   NaN  Barcelona
3    NaN  40.0    Sevilla
4  Maria  35.0        NaN
Valores faltantes por columna
Nombre    1
Edad      1
Ciudad    2
dtype: int64
  Nombre   Edad     Ciudad
0    Ana  23.00     Madrid
1   Juan  29.00        NaN
2  Pedro  31.75  Barcelona
3    NaN  40.00    Sevilla
4  Maria  35.00        NaN

In [16]:
df['Edad']=df['Edad'].fillna(df['Edad'].mean())
df['Nombre']=df['Nombre'].fillna('Desconocido')
df['Ciudad']=df['Ciudad'].fillna('Desconocido')

print(df)

print("Datos despues del manejo de faltantes ")
print(df.isnull().sum())

print("Datos duplicados en el dataset")
print(df[df.duplicated()])

df.drop_duplicates(inplace=True)

print("Datos despues de eliminar los duplicados")
print(df)

        Nombre   Edad       Ciudad
0          Ana  23.00       Madrid
1         Juan  29.00  Desconocido
2        Pedro  31.75    Barcelona
3  Desconocido  40.00      Sevilla
4        Maria  35.00  Desconocido
Datos despues del manejo de faltantes
Nombre    0
Edad      0
Ciudad    0
dtype: int64
Datos duplicados en el dataset
Empty DataFrame
Columns: [Nombre, Edad, Ciudad]
Index: []
Datos despues de eliminar los duplicados
        Nombre   Edad       Ciudad
0          Ana  23.00       Madrid
1         Juan  29.00  Desconocido
2        Pedro  31.75    Barcelona
3  Desconocido  40.00      Sevilla
4        Maria  35.00  Desconocido

# Diccionarios

In [23]:
import pandas as pd

data = {
    'Nombre':      ['Juan', 'Ana', 'Pedro', 'Mar√≠a', 'Luis', 'Ana'],
    'Edad':        [28, 34, None, 45, 38, 34],
    'Salario':     ['3000', '4000', 'cincomil', '4500', '4000', '5000'],
    'FechaIngreso':['2021-01-15', '2020/03/12', '2022-07-01',
                    '2021/12/01', '2021-05-20', '2020-03-12']
}

df = pd.DataFrame(data)
print(df)


valores_faltantes = df.isnull().sum()
print(valores_faltantes)

salarios_incorrectos=df[~df['Salario'].astype(str).str.match(r'^\d+$')]
print(salarios_incorrectos)

  Nombre  Edad   Salario FechaIngreso
0   Juan  28.0      3000   2021-01-15
1    Ana  34.0      4000   2020/03/12
2  Pedro   NaN  cincomil   2022-07-01
3  Mar√≠a  45.0      4500   2021/12/01
4   Luis  38.0      4000   2021-05-20
5    Ana  34.0      5000   2020-03-12
Nombre          0
Edad            1
Salario         0
FechaIngreso    0
dtype: int64
  Nombre  Edad   Salario FechaIngreso
2  Pedro   NaN  cincomil   2022-07-01